{"name":"Airport","properties":{"photo":{"description":"A photograph of this place. Supersedes photos.","type":"Photograph"},"additionalProperty":{"description":"A property-value pair representing an additional characteristics of the  entitity, e.g. a product feature or another characteristic for which there  is no matching property in schema.org.  Note: Publishers should be aware that applications designed to use specific  schema.org properties (e.g. http://schema.org/width,  http://schema.org/color, http://schema.org/gtin13, ...) will typically  expect such data to be provided using those properties, rather than using  the generic property/value mechanism.","type":"PropertyValue"},"review":{"description":"A review of the item. Supersedes reviews.","type":"Review"},"description":{"description":"A short description of the item.","type":"string"},"branchCode":{"description":"A short textual code (also called \"store code\") that uniquely identifies a  place of business. The code is typically assigned by the parentOrganization  and used in structured URLs.  For example, in the URL  http://www.starbucks.co.uk/store-locator/etc/detail/3047 the code \"3047\" is  a branchCode for a particular branch.","type":"string"},"hasMap":{"description":"A URL to a map of the place. Supersedes map, maps.","type":"URL"},"additionalType":{"description":"An additional type for the item, typically used for adding more specific  types from external vocabularies in microdata syntax. This is a  relationship between something and a class that the thing is in. In RDFa  syntax, it is better to use the native RDFa syntax - the 'typeof' attribute  - for multiple types. Schema.org tools may have only weaker understanding  of extra types, in particular those defined externally.","type":"URL"},"alternateName":{"description":"An alias for the item.","type":"string"},"logo":{"description":"An associated logo.","type":"ImageObject"},"image":{"description":"An image of the item. This can be a URL or a fully described ImageObject.","type":"URL"},"icaoCode":{"description":"IACO identifier for an airport.","type":"string"},"iataCode":{"description":"IATA identifier for an airline or airport.","type":"string"},"mainEntityOfPage":{"description":"Indicates a page (or other CreativeWork) for which this thing is the main  entity being described.  See background notes for details. Inverse property: mainEntity.","type":"URL"},"potentialAction":{"description":"Indicates a potential Action, which describes an idealized action in which  this thing would play an 'object' role.","type":"Action"},"address":{"description":"Physical address of the item.","type":"Text"},"containsPlace":{"description":"The basic containment relation between a place and another that it contains. Inverse property: containsPlace.","type":"Place"},"containedInPlace":{"description":"The basic containment relation between a place and one that contains it.  Supersedes containedIn. Inverse property: containsPlace.","type":"Place"},"faxNumber":{"description":"The fax number.","type":"string"},"geo":{"description":"The geo coordinates of the place.","type":"GeoCoordinates"},"globalLocationNumber":{"description":"The Global Location Number (GLN, sometimes also referred to as  International Location Number or ILN) of the respective organization,  person, or place. The GLN is a 13-digit number used to identify parties and  physical locations.","type":"string"},"isicV4":{"description":"The International Standard of Industrial Classification of All Economic  Activities (ISIC), Revision 4 code for a particular organization, business  person, or place.","type":"string"},"name":{"description":"The name of the item.","type":"string"},"openingHours":{"description":"The opening hours for a business. Opening hours can be specified as a  weekly time range, starting with days, then times per day. Multiple days  can be listed with commas ',' separating each day. Day or time ranges are  specified using a hyphen '-'. - Days are specified using the following two-letter combinations: Mo, Tu, We,  Th, Fr, Sa, Su. - Times are specified using 24:00 time. For example, 3pm is specified as  15:00. - Here is an example: Tuesdays and Thursdays 4-8pm. - If a business is open 7 days a week, then it can be specified as Monday  through Sunday, all day.","type":"string"},"openingHoursSpecification":{"description":"The opening hours of a certain place.","type":"OpeningHoursSpecification"},"aggregateRating":{"description":"The overall rating, based on a collection of reviews or ratings, of the  item.","type":"AggregateRating"},"telephone":{"description":"The telephone number.","type":"string"},"event":{"description":"Upcoming or past event associated with this place, organization, or action.  Supersedes events.","type":"Event"},"sameAs":{"description":"URL of a reference Web page that unambiguously indicates the item's  identity. E.g. the URL of the item's Wikipedia page, Freebase page, or  official website.","type":"URL"},"url":{"description":"URL of the item.","type":"URL"}}}