{"name":"ContactPoint","properties":{"availableLanguage":{"description":"A language someone may use with the item.","type":"Language"},"contactType":{"description":"A person or organization can have different contact points, for different  purposes. For example, a sales contact point, a PR contact point and so on.  This property is used to specify the kind of contact point.","type":"string"},"description":{"description":"A short description of the item.","type":"string"},"additionalType":{"description":"An additional type for the item, typically used for adding more specific  types from external vocabularies in microdata syntax. This is a  relationship between something and a class that the thing is in. In RDFa  syntax, it is better to use the native RDFa syntax - the 'typeof' attribute  - for multiple types. Schema.org tools may have only weaker understanding  of extra types, in particular those defined externally.","type":"URL"},"alternateName":{"description":"An alias for the item.","type":"string"},"image":{"description":"An image of the item. This can be a URL or a fully described ImageObject.","type":"ImageObject"},"contactOption":{"description":"An option available on this contact point (e.g. a toll-free number or  support for hearing-impaired callers).","type":"ContactPointOption"},"email":{"description":"Email address.","type":"string"},"mainEntityOfPage":{"description":"Indicates a page (or other CreativeWork) for which this thing is the main  entity being described.  See background notes for details. Inverse property: mainEntity.","type":"URL"},"potentialAction":{"description":"Indicates a potential Action, which describes an idealized action in which  this thing would play an 'object' role.","type":"Action"},"faxNumber":{"description":"The fax number.","type":"string"},"areaServed":{"description":"The geographic area where a service or offered item is provided. Supersedes  serviceArea.","type":"AdministrativeArea"},"hoursAvailable":{"description":"The hours during which this service or contact is available.","type":"OpeningHoursSpecification"},"name":{"description":"The name of the item.","type":"string"},"productSupported":{"description":"The product or service this support contact point is related to (such as  product support for a particular product line). This can be a specific  product or product line (e.g. \"iPhone\") or a general category of products  or services (e.g. \"smartphones\").","type":"Text"},"telephone":{"description":"The telephone number.","type":"string"},"sameAs":{"description":"URL of a reference Web page that unambiguously indicates the item's  identity. E.g. the URL of the item's Wikipedia page, Freebase page, or  official website.","type":"URL"},"url":{"description":"URL of the item.","type":"URL"}}}